Table of Contents
 Class RegexReplace
Namespace
IdeaStatiCa.PluginsTools.CrossSectionConversions
Assembly
IdeaStatiCa.Plugin.dll
public class RegexReplace : Conversion
Inheritance
object
Conversion
RegexReplace
Inherited Members
 Conversion.MatchRegex
 Conversion.IsMatch(string)
 object.ToString()
 object.Equals(object)
 object.Equals(object, object)
 object.ReferenceEquals(object, object)
 object.GetHashCode()
 object.GetType()
 object.MemberwiseClone()
Constructors
 RegexReplace(string, string)
public RegexReplace(string pattern, string replace)
Parameters
pattern string
replace string
 RegexReplace(string, string, string)
public RegexReplace(string pattern, string find, string replace)
Parameters
pattern string
find string
replace string
Methods
 Convert(string)
public override string Convert(string text)
Parameters
text string
Returns
string
 Edit this page